# PresetInitialColor Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PresetInitialColor Properties
PresetInitialColor Class See Also
---
The PresetInitialColor type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from InitialColor.) |
| Preset | The preset value |
| TemperatureValue | The light color temperature value in Kelvins.  (Inherited from InitialColor.) |

# See Also
PresetInitialColor Class
Autodesk.Revit.DB.Lighting Namespace